# BB84 params
BITS_BASES_LENGTH = 100
SAMPLE_SIZE = 10
# SHOR's params
SHOR_COUNT = 8
SHOR_BASE = 7


# TODO
# 1. Вместо отбрасывания рандомных кубит - сравнивать и считать процент несовпавших (QBER)
# 2. Затестить реализацию шумов в канале
# 3. Вынести выбор бэка и эмуляцию в отдельные классы для более удобного и информативного вывода
# Дальше надо ресерчить
# 4. Посмотреть в сторону генератора случайных чисел
# 5. Посмотреть в сторону реализации модели атак
# 6. Посмотреть в сторону модификаций биби
